meeting/minutes/2026/03-31.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>QT4 CG Meeting 158 Minutes 2026-03-31</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
<link rel="shortcut icon" href="/img/QT4-64.png" />
<link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
<link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
<link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
<link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">QT4 CG Meeting 158 Minutes 2026-03-31</h1>
<p>
<a href="../">Meeting index</a> / <a href="https://qt4cg.org">QT4CG.org</a> / <a href="https://qt4cg.org/dashboard">Dashboard</a> / <a href="https://github.com/qt4cg/qtspecs/issues">GH Issues</a> / <a href="https://github.com/qt4cg/qtspecs/pulls">GH Pull Requests</a>
</p>

<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#new-actions">Summary of new and continuing actions <code>[0/8]</code></a></li>
<li><a href="#minutes">Minutes</a></li>
<li><a href="#administrivia">1. Administrivia</a>
<ul>
<li><a href="#roll-call">1.1. Roll call <code>[8/10]</code></a></li>
<li><a href="#agenda">1.2. Accept the agenda</a></li>
<li><a href="#approve-minutes">1.3. Approve minutes of the previous meeting</a></li>
<li><a href="#next-meeting">1.4. Next meeting</a></li>
<li><a href="#open-actions">1.5. Review of open action items <code>[0/8]</code></a></li>
<li><a href="#open-pull-requests">1.6. Review of open pull requests and issues</a>
<ul>
<li><a href="#merge-without-discussion">1.6.1. Merge without discussion</a></li>
<li><a href="#close-without-action">1.6.2. Close without action</a></li>
<li><a href="#substantive">1.6.3. Substantive PRs</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#technical-agenda">2. Technical agenda</a>
<ul>
<li><a href="#pr-2559">2.1. PR #2559: 2549 Functional purity</a></li>
<li><a href="#pr-2558">2.2. PR #2558: 2556 errors for invisible-xml() and doc()</a></li>
<li><a href="#pr-2552">2.3. PR #2552: 540bis Add system-properties() function</a></li>
<li><a href="#pr-2533">2.4. PR #2533: 2528 Update RFC reference (7159 -&gt; 8259) for JSON</a></li>
<li><a href="#pr-2531">2.5. PR #2531: QT4CG-154-02 Revise rules for setting stylesheet parameters</a></li>
<li><a href="#pr-2516">2.6. PR #2516: 2433 JTree function: Discuss JNode identity more fully</a></li>
<li><a href="#pr-2551">2.7. 2.6a: PR #2551 - shadow attribute in a RNG schema</a></li>
<li><a href="#pr-2019">2.8. PR #2019: 1776: XSLT template rules for maps and array</a></li>
</ul>
</li>
<li><a href="#any-other-business">3. Any other business</a></li>
</ul>
</div>
</div>
<div id="outline-container-new-actions" class="outline-2">
<h2 id="new-actions">Summary of new and continuing actions <code>[0/8]</code></h2>
<div class="outline-text-2" id="text-new-actions">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> QT4CG-143-02: MK to try to recover the ability to extract formal equivalences into tests</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-144-01: MK to consider if any now lost value comparisons should be added as examples.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-150-01: NW to ask Jirka for a room at XML Prague for Tuesday/Wednesday</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-150-04: NW to see about a status update on PR #2345; possibly schedule discussion</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-156-01: MK: add reference to data model in F&amp;O 9.2</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-156-03: MK to revise PR #2516 in light of the comments.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-157-01: CG to consider the issue of such empty directories</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-157-02: CG to propose an editorial change to use the fos:notes construct for the Notes. Also relevant to #2546</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-158-01: MK to revisit the Conformance section to revise in light of #2556 error changes</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-158-02: MK to add <code>system-properties()</code> keys for file and binary support</li>
</ul>
</div>
</div>
<div id="outline-container-minutes" class="outline-2">
<h2 id="minutes">Minutes</h2>
<div class="outline-text-2" id="text-minutes">
<p>
Approved <a href="../2026/04-07.html">at meeting 159</a> on 7 April 2026.
</p>
</div>
</div>
<div id="outline-container-administrivia" class="outline-2">
<h2 id="administrivia"><span class="section-number-2">1.</span> Administrivia</h2>
<div class="outline-text-2" id="text-administrivia">
</div>
<div id="outline-container-roll-call" class="outline-3">
<h3 id="roll-call"><span class="section-number-3">1.1.</span> Roll call <code>[8/10]</code></h3>
<div class="outline-text-3" id="text-roll-call">
<p>
Regrets: DB, NW
</p>

<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> David J Birnbaum (DB)</li>
<li class="on"><code>[X]</code> Reece Dunn (RD)</li>
<li class="on"><code>[X]</code> Christian Grün (CG)</li>
<li class="on"><code>[X]</code> Joel Kalvesmaki (JK) <i>Chair</i>.</li>
<li class="on"><code>[X]</code> Michael Kay (MK)</li>
<li class="on"><code>[X]</code> Juri Leino (JLO)</li>
<li class="on"><code>[X]</code> John Lumley (JWL) <i>Scribe</i></li>
<li class="on"><code>[X]</code> Alan Painter (AP</li>
<li class="on"><code>[X]</code> Wendell Piez (WP)</li>
<li class="off"><code>[&#xa0;]</code> Norm Tovey-Walsh (NW)</li>
</ul>

<p>
NW thanks JK and JWL. Assume any errors introduced in the minutes are NW’s
fault.
</p>
</div>
</div>
<div id="outline-container-agenda" class="outline-3">
<h3 id="agenda"><span class="section-number-3">1.2.</span> Accept the agenda</h3>
<div class="outline-text-3" id="text-agenda">
<p>
Proposal: Accept <a href="../../agenda/2026/03-31.html">the agenda</a>.
</p>

<p>
Accepted with PR #2551 removed; issue 2.7 is not ready.
</p>
</div>
</div>
<div id="outline-container-approve-minutes" class="outline-3">
<h3 id="approve-minutes"><span class="section-number-3">1.3.</span> Approve minutes of the previous meeting</h3>
<div class="outline-text-3" id="text-approve-minutes">
<p>
Proposal: Accept <a href="../../minutes/2026/03-24.html">the minutes of the previous meeting</a>.
</p>

<p>
Accepted.
</p>
</div>
</div>
<div id="outline-container-next-meeting" class="outline-3">
<h3 id="next-meeting"><span class="section-number-3">1.4.</span> Next meeting</h3>
<div class="outline-text-3" id="text-next-meeting">
<p>
The next meeting is planned for 7 April 2026.
</p>

<p>
JWL gives regrets for 7, 14, and 21 April.
</p>
</div>
</div>
<div id="outline-container-open-actions" class="outline-3">
<h3 id="open-actions"><span class="section-number-3">1.5.</span> Review of open action items <code>[0/8]</code></h3>
<div class="outline-text-3" id="text-open-actions">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> QT4CG-143-02: MK to try to recover the ability to extract formal equivalences into tests</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-144-01: MK to consider if any now lost value comparisons should be added as examples.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-150-01: NW to ask Jirka for a room at XML Prague for Tuesday/Wednesday</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-150-04: NW to see about a status update on PR #2345; possibly schedule discussion</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-156-01: MK: add reference to data model in F&amp;O 9.2</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-156-03: MK to revise PR #2516 in light of the comments.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-157-01: CG to consider the issue of such empty directories</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-157-02: CG to propose an editorial change to use the fos:notes construct for the Notes. Also relevant to #2546</li>
</ul>
</div>
</div>
<div id="outline-container-open-pull-requests" class="outline-3">
<h3 id="open-pull-requests"><span class="section-number-3">1.6.</span> Review of open pull requests and issues</h3>
<div class="outline-text-3" id="text-open-pull-requests">
<p>
This section summarizes all of the issues and pull requests that need to be
resolved before we can finish. See <a href="#technical-agenda">Technical Agenda</a> below for the focus of this
meeting.
</p>
</div>
<div id="outline-container-merge-without-discussion" class="outline-4">
<h4 id="merge-without-discussion"><span class="section-number-4">1.6.1.</span> Merge without discussion</h4>
<div class="outline-text-4" id="text-merge-without-discussion">
<p>
The following PRs are editorial, small, or otherwise appeared to be
uncontroversial when the agenda was prepared. The chairs propose that
these can be merged without discussion. If you think discussion is
necessary, please say so.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2563">#2563</a>: 2562 Empty fields in parts-of-dateTime result now absent</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2560">#2560</a>: 2321 Make fn:trace and fn:message nondeterministic</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2555">#2555</a>: 2215 Add "see also" links between functions</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2545">#2545</a>: 2544 Drop xsl:record-type/@extensible</li>
</ul>

<p>
Proposal: merge without discussion. 
</p>

<p>
Accepted.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2551">#2551</a>: 2550 Shadow attributes in RelaxNG schema
<ul class="org-ul">
<li>Moved to the technical agenda</li>
</ul></li>
</ul>
</div>
</div>
