meeting/minutes/2026/03-31.org
*** Close without action
:PROPERTIES:
:CUSTOM_ID: close-without-action
:END:

It has been proposed that the following issues be closed without action.
If you think discussion is necessary, please say so.

+ Issue [[https://github.com/qt4cg/qtspecs/issues/2526][#2526]]: Facets
+ Issue [[https://github.com/qt4cg/qtspecs/issues/2325][#2325]]: Specify evaluation more tight and more formal to disallow unsane cases
+ Issue [[https://github.com/qt4cg/qtspecs/issues/2252][#2252]]: Dynamic XPath Evaluation the functional way

Proposal: close without further action.

Accepted.

*** Substantive PRs
:PROPERTIES:
:CUSTOM_ID: substantive
:END:

The following substantive PRs were open when this agenda was prepared.

+ PR [[https://qt4cg.org/dashboard/#pr-2559][#2559]]: 2549 Functional purity
+ PR [[https://qt4cg.org/dashboard/#pr-2558][#2558]]: 2556 errors for invisible-xml() and doc()
+ PR [[https://qt4cg.org/dashboard/#pr-2552][#2552]]: 540bis Add system-properties() function
+ PR [[https://qt4cg.org/dashboard/#pr-2533][#2533]]: 2528 Update RFC reference (7159 -> 8259) for JSON 
+ PR [[https://qt4cg.org/dashboard/#pr-2531][#2531]]: QT4CG-154-02 Revise rules for setting stylesheet parameters
+ PR [[https://qt4cg.org/dashboard/#pr-2516][#2516]]: 2433 JTree function: Discuss JNode identity more fully
+ PR [[https://qt4cg.org/dashboard/#pr-2019][#2019]]: 1776: XSLT template rules for maps and array

* Technical agenda
:PROPERTIES:
:CUSTOM_ID: technical-agenda
:END:

** PR #2559: 2549 Functional purity
:PROPERTIES:
:CUSTOM_ID: pr-2559
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2559][#2559]].

+ MK: arises from incorporating the File module. This needs a bit more detail
  and recommendations of the problem of possible side-effects on functional
  'purity'. A short essay to document current understanding.
  + … Explains what are the benefits of a functional language and the issues
    that might make this difficult. Eg. errors and node construction
    withidentity. Advice to users to mitigate or reduce the problems.
  + … Then some discussion of much more serious side-effecting functions.
  + … No attempt to tackle conformance rules.
  + .. No attempt to enumerate all the cases of side-effect caution.
+ JLO: Looks a good addition, giving guidance to both implementors and users.
  Would like to have some indication of side-effct risk on functions in the
  spec. 1.c - covers side-effects *other* than errors (comfirmed by MK)
+ AP: Could there be a 'lint-type' utility to identify problem ares for these side effects.
+ MK: Next stage could be to add something to the language to add this sort of check formnally.
+ CG: XQUery Update in their implementation has a non-deterministic property
  available, though it hasn't really been used. Would take a long time to do it
  all formally.

Proposal: accept this PR.

Accepted.

** PR #2558: 2556 errors for invisible-xml() and doc()
:PROPERTIES:
:CUSTOM_ID: pr-2558
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2558][#2558]].

+ MK: Started with ~invisible-xml()~ and it expanded to ~parse-xml()~ and thence ~doc()~
  + … Added specific errors for some of the violations, e.g. validation failure, unsupported options keywords
     (See the PR for the specific errors added)
  + … Arranged that ~parse-xml()~ and ~doc()~ use same wording in the
    descriptions ~invisible-xml()~ moves the error descriptions into an error
    conditions section. (Means lack of an invisible XML processor can raise an
    error rather than conformance failure, c.f the same with ~fn:transform()~)
+ JLO: Could we have more detailed error codes on ~parse-xml()~
+ MK:  Difficult with plug-in implementations.

ACTION QT4CG-158-01: MK to revisit the Conformance section to revise in light of #2556 error changes

Proposal: accept this PR.

Accepted.

** PR #2552: 540bis Add system-properties() function
:PROPERTIES:
:CUSTOM_ID: pr-2552
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2552][#2552]].

+ MK: Original idea was to add the XSLT system-property() function into XPAth,
  but those properties names are in the XSLT namespace. Solution to produce a
  new function, ~system-properties()~, which will use (add) no-namespace QNames,
  and is effectively a subset of the XSLT version. Can be a full replacement for
  ~system-property()~
+ JK: Will XSL properties be available in non-XSLT situations.
+ MK: No.
+ JK: What about adding supports-file, supports-binary.

ACTION QT4CG-158-02: MK to add ~system-properties()~ keys for file and binary support

+ JLO: Records can't be extended. Does this cause problems?
+ MK: No (some discussion)
+ CG: Would it be easier for users if the default keys were strings as well as QNames
+ MK: Becomes a bit messy.
+ JLO: Serialization options has both strings and QNames

Proposal: accept this PR.

Accepted.

** PR #2533: 2528 Update RFC reference (7159 -> 8259) for JSON 
:PROPERTIES:
:CUSTOM_ID: pr-2533
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2533][#2533]].

+ MK: Pretty trivial, as JSON spec has moved on with no appreciable material change.
     Minor editorial changes.
+ AP: It's now a real rather than proposed standard. Agreed with ECMA and IETF. 
     (Talked about this at 2024 Prague)
+ MK: Some small additions/changes in F&O regarding BOM etc.

Proposal: accept this PR.

Accepted.

** PR #2531: QT4CG-154-02 Revise rules for setting stylesheet parameters
:PROPERTIES:
:CUSTOM_ID: pr-2531
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2531][#2531]].

+ MK: Came from the proposal to add xsl:with-param to xsl:use-package.
  + … Revealed a bug in 3.0 where there was confusion about private and public parameter default visibilities
  + … More careful distinction between static and dynamic parameters in these cases.

Proposal: accept this PR.

Accepted.

** PR #2516: 2433 JTree function: Discuss JNode identity more fully
:PROPERTIES:
:CUSTOM_ID: pr-2516
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2516][#2516]].

+ MK: Address this issue at CG's request. A general set of notes about the identity of similar/same trees
  + … All we can say is that two trees with differing content have different identity.
  + … Not as strong a guarantee as we can give for XNodes
  + … Only important in cases with extractions for the same tree, including de-duplication
  + … Notes about where jtree() is call *implicitly*
     (Note context doesn't support much internal structure)
+ WP: Looks helpful. Having a JNode from a tree vs ???
+ JLO: Even though it is weakly defined, can I assume identical expressions on the same tree
     would produce the same identiies? What about via variables.
+ MK: An optimizer may have inlined the content of the variable, making several tree copies.
     OPtimizers aren't constrained not to expand in multiple places.

Proposal: accept this PR.

Accepted.

