meeting/minutes/2026/03-31.html
<div id="outline-container-close-without-action" class="outline-4">
<h4 id="close-without-action"><span class="section-number-4">1.6.2.</span> Close without action</h4>
<div class="outline-text-4" id="text-close-without-action">
<p>
It has been proposed that the following issues be closed without action.
If you think discussion is necessary, please say so.
</p>

<ul class="org-ul">
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/2526">#2526</a>: Facets</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/2325">#2325</a>: Specify evaluation more tight and more formal to disallow unsane cases</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/2252">#2252</a>: Dynamic XPath Evaluation the functional way</li>
</ul>

<p>
Proposal: close without further action.
</p>

<p>
Accepted.
</p>
</div>
</div>
<div id="outline-container-substantive" class="outline-4">
<h4 id="substantive"><span class="section-number-4">1.6.3.</span> Substantive PRs</h4>
<div class="outline-text-4" id="text-substantive">
<p>
The following substantive PRs were open when this agenda was prepared.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2559">#2559</a>: 2549 Functional purity</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2558">#2558</a>: 2556 errors for invisible-xml() and doc()</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2552">#2552</a>: 540bis Add system-properties() function</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2533">#2533</a>: 2528 Update RFC reference (7159 -&gt; 8259) for JSON</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2531">#2531</a>: QT4CG-154-02 Revise rules for setting stylesheet parameters</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2516">#2516</a>: 2433 JTree function: Discuss JNode identity more fully</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2019">#2019</a>: 1776: XSLT template rules for maps and array</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-technical-agenda" class="outline-2">
<h2 id="technical-agenda"><span class="section-number-2">2.</span> Technical agenda</h2>
<div class="outline-text-2" id="text-technical-agenda">
</div>
<div id="outline-container-pr-2559" class="outline-3">
<h3 id="pr-2559"><span class="section-number-3">2.1.</span> PR #2559: 2549 Functional purity</h3>
<div class="outline-text-3" id="text-pr-2559">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2559">#2559</a>.
</p>

<ul class="org-ul">
<li>MK: arises from incorporating the File module. This needs a bit more detail
and recommendations of the problem of possible side-effects on functional
'purity'. A short essay to document current understanding.
<ul class="org-ul">
<li>… Explains what are the benefits of a functional language and the issues
that might make this difficult. Eg. errors and node construction
withidentity. Advice to users to mitigate or reduce the problems.</li>
<li>… Then some discussion of much more serious side-effecting functions.</li>
<li>… No attempt to tackle conformance rules.</li>
<li>.. No attempt to enumerate all the cases of side-effect caution.</li>
</ul></li>
<li>JLO: Looks a good addition, giving guidance to both implementors and users.
Would like to have some indication of side-effct risk on functions in the
spec. 1.c - covers side-effects <b>other</b> than errors (comfirmed by MK)</li>
<li>AP: Could there be a 'lint-type' utility to identify problem ares for these side effects.</li>
<li>MK: Next stage could be to add something to the language to add this sort of check formnally.</li>
<li>CG: XQUery Update in their implementation has a non-deterministic property
available, though it hasn't really been used. Would take a long time to do it
all formally.</li>
</ul>

<p>
Proposal: accept this PR.
</p>

<p>
Accepted.
</p>
</div>
</div>
<div id="outline-container-pr-2558" class="outline-3">
<h3 id="pr-2558"><span class="section-number-3">2.2.</span> PR #2558: 2556 errors for invisible-xml() and doc()</h3>
<div class="outline-text-3" id="text-pr-2558">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2558">#2558</a>.
</p>

<ul class="org-ul">
<li>MK: Started with <code>invisible-xml()</code> and it expanded to <code>parse-xml()</code> and thence <code>doc()</code>
<ul class="org-ul">
<li>… Added specific errors for some of the violations, e.g. validation failure, unsupported options keywords
(See the PR for the specific errors added)</li>
<li>… Arranged that <code>parse-xml()</code> and <code>doc()</code> use same wording in the
descriptions <code>invisible-xml()</code> moves the error descriptions into an error
conditions section. (Means lack of an invisible XML processor can raise an
error rather than conformance failure, c.f the same with <code>fn:transform()</code>)</li>
</ul></li>
<li>JLO: Could we have more detailed error codes on <code>parse-xml()</code></li>
<li>MK:  Difficult with plug-in implementations.</li>
</ul>

<p>
ACTION QT4CG-158-01: MK to revisit the Conformance section to revise in light of #2556 error changes
</p>

<p>
Proposal: accept this PR.
</p>

<p>
Accepted.
</p>
</div>
</div>
<div id="outline-container-pr-2552" class="outline-3">
<h3 id="pr-2552"><span class="section-number-3">2.3.</span> PR #2552: 540bis Add system-properties() function</h3>
<div class="outline-text-3" id="text-pr-2552">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2552">#2552</a>.
</p>

<ul class="org-ul">
<li>MK: Original idea was to add the XSLT system-property() function into XPAth,
but those properties names are in the XSLT namespace. Solution to produce a
new function, <code>system-properties()</code>, which will use (add) no-namespace QNames,
and is effectively a subset of the XSLT version. Can be a full replacement for
<code>system-property()</code></li>
<li>JK: Will XSL properties be available in non-XSLT situations.</li>
<li>MK: No.</li>
<li>JK: What about adding supports-file, supports-binary.</li>
</ul>

<p>
ACTION QT4CG-158-02: MK to add <code>system-properties()</code> keys for file and binary support
</p>

<ul class="org-ul">
<li>JLO: Records can't be extended. Does this cause problems?</li>
<li>MK: No (some discussion)</li>
<li>CG: Would it be easier for users if the default keys were strings as well as QNames</li>
<li>MK: Becomes a bit messy.</li>
<li>JLO: Serialization options has both strings and QNames</li>
</ul>

<p>
Proposal: accept this PR.
</p>

<p>
Accepted.
</p>
</div>
</div>
<div id="outline-container-pr-2533" class="outline-3">
<h3 id="pr-2533"><span class="section-number-3">2.4.</span> PR #2533: 2528 Update RFC reference (7159 -&gt; 8259) for JSON</h3>
<div class="outline-text-3" id="text-pr-2533">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2533">#2533</a>.
</p>

<ul class="org-ul">
<li>MK: Pretty trivial, as JSON spec has moved on with no appreciable material change.
Minor editorial changes.</li>
<li>AP: It's now a real rather than proposed standard. Agreed with ECMA and IETF. 
(Talked about this at 2024 Prague)</li>
<li>MK: Some small additions/changes in F&amp;O regarding BOM etc.</li>
</ul>

<p>
Proposal: accept this PR.
</p>

<p>
Accepted.
</p>
</div>
</div>
<div id="outline-container-pr-2531" class="outline-3">
<h3 id="pr-2531"><span class="section-number-3">2.5.</span> PR #2531: QT4CG-154-02 Revise rules for setting stylesheet parameters</h3>
<div class="outline-text-3" id="text-pr-2531">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2531">#2531</a>.
</p>

<ul class="org-ul">
<li>MK: Came from the proposal to add xsl:with-param to xsl:use-package.
<ul class="org-ul">
<li>… Revealed a bug in 3.0 where there was confusion about private and public parameter default visibilities</li>
<li>… More careful distinction between static and dynamic parameters in these cases.</li>
</ul></li>
</ul>

<p>
Proposal: accept this PR.
</p>

<p>
Accepted.
</p>
</div>
</div>
<div id="outline-container-pr-2516" class="outline-3">
<h3 id="pr-2516"><span class="section-number-3">2.6.</span> PR #2516: 2433 JTree function: Discuss JNode identity more fully</h3>
<div class="outline-text-3" id="text-pr-2516">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2516">#2516</a>.
</p>

<ul class="org-ul">
<li>MK: Address this issue at CG's request. A general set of notes about the identity of similar/same trees
<ul class="org-ul">
<li>… All we can say is that two trees with differing content have different identity.</li>
<li>… Not as strong a guarantee as we can give for XNodes</li>
<li>… Only important in cases with extractions for the same tree, including de-duplication</li>
<li>… Notes about where jtree() is call <b>implicitly</b>
(Note context doesn't support much internal structure)</li>
</ul></li>
<li>WP: Looks helpful. Having a JNode from a tree vs ???</li>
<li>JLO: Even though it is weakly defined, can I assume identical expressions on the same tree
would produce the same identiies? What about via variables.</li>
<li>MK: An optimizer may have inlined the content of the variable, making several tree copies.
OPtimizers aren't constrained not to expand in multiple places.</li>
</ul>

<p>
Proposal: accept this PR.
</p>

<p>
Accepted.
</p>
</div>
</div>
