meeting/minutes/2026/03-31.org
** 2.6a: PR #2551 - shadow attribute in a RNG schema
:PROPERTIES:
:CUSTOM_ID: pr-2551
:END:

+ MK: Don't really understand what it's trying to - not an RNG specialist. 
  + … NW might want to get involved. 
+ MK: I'll withdraw the PR and assign to NW.
+ WP: Willing to help NW with this. Needs validation.

PR #2551 will be abandoned.

** PR #2019: 1776: XSLT template rules for maps and array
:PROPERTIES:
:CUSTOM_ID: pr-2019
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2019][#2019]].

Not ready for discussion.

* Any other business
:PROPERTIES:
:CUSTOM_ID: any-other-business
:END:

None heard.
