meeting/minutes/2026/03-31.html
<div id="outline-container-pr-2551" class="outline-3">
<h3 id="pr-2551"><span class="section-number-3">2.7.</span> 2.6a: PR #2551 - shadow attribute in a RNG schema</h3>
<div class="outline-text-3" id="text-pr-2551">
<ul class="org-ul">
<li>MK: Don't really understand what it's trying to - not an RNG specialist. 
<ul class="org-ul">
<li>… NW might want to get involved.</li>
</ul></li>
<li>MK: I'll withdraw the PR and assign to NW.</li>
<li>WP: Willing to help NW with this. Needs validation.</li>
</ul>

<p>
PR #2551 will be abandoned.
</p>
</div>
</div>
<div id="outline-container-pr-2019" class="outline-3">
<h3 id="pr-2019"><span class="section-number-3">2.8.</span> PR #2019: 1776: XSLT template rules for maps and array</h3>
<div class="outline-text-3" id="text-pr-2019">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2019">#2019</a>.
</p>

<p>
Not ready for discussion.
</p>
</div>
</div>
</div>
<div id="outline-container-any-other-business" class="outline-2">
<h2 id="any-other-business"><span class="section-number-2">3.</span> Any other business</h2>
<div class="outline-text-2" id="text-any-other-business">
<p>
None heard.
</p>
</div>
</div>
</div>
</body>
</html>
